БИТУправление_медицинским_центром_демо/src/InformationRegisters/ДействияМедосмотровПараметрыАвтозаключений/ДействияМедосмотровПараметрыАвтозаключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДействияМедосмотровПараметрыАвтозаключений</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДействиеМедосмотра</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СпециализацииШаблоновОсмотра/СпециализацииШаблоновОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпециализацииШаблоновОсмотра</name>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Профосмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/ШаблоныHTML/ШаблоныHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныHTML</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстHTML</name>
    <comment>Строка, содержащая HTML-шаблон для подстановки в поля HTML-документов программы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШаблона</name>
    <type>
      <types>EnumRef.ВидыШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетСЗубнойКартой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатаетсяБезПереходаНаНовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличныйДокумент</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьРазмерБумаги</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОриентацияСтраницы</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьАвтомасштабирование</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьДвусторонняяПечать</name>
    <comment>Только для справок и прочих медосмотров. Использовать настройки принтера(0), Нет(1), Переворот вверх(2), Переворот влево(3)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСЭМД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеПодписи</name>
    <type>
      <types>Number</types>
      <types>EnumRef.РасположениеПодписи</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьШапкуШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЭЦПТабличногоШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМедицинскойДокументации</name>
    <type>
      <types>CatalogRef.ВидыМедицинскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьОтдельныйЭМД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьДиагнозыИзТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствияПараметрам</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеМедосмотра</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединяющееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокИзображений</name>
    <attributes>
      <name>ИзображениеBase64</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияТаблицамШаблонов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаШаблонов</name>
      <type>
        <types>CatalogRef.ТаблицыШаблоновПриема</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонстантыCDAДокумента</name>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиПодписей</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
        <types>EnumRef.РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимНастройкиДоступности</name>
      <type>
        <types>EnumRef.РежимыНастройкиДоступностиРоли</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакДоступностиРоли</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРоли</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ДействияМедосмотровПараметрыАвтозаключений/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("ДействиеМедосмотра", ДействиеМедосмотра);
	Если Не ДействиеМедосмотра.Пустая() Тогда
		
		ЗаполнениеПараметровПоШаблону( , ТаблицаПараметровШаблона); // Пустой шаблон.
		// Отбор шаблонов по специализации действия м/о
		Специализация = ДействиеМедосмотра.Специализация;
		НаборЗаписей = РегистрыСведений.СпециализацииШаблоновОсмотра.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Специализация.Установить(ДействиеМедосмотра.Специализация);
		НаборЗаписей.Прочитать();
		МассивШаблонов = НаборЗаписей.ВыгрузитьКолонку("ШаблонОсмотра");
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(МассивШаблонов);
		
		РаботаСФормамиСервер.УстановитьОтборСписка("Ссылка", СписокЗначений, ТаблицаШаблонов);
		
		// Скрытие групп
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ШаблоныОсмотров.Ссылка КАК Ссылка,
		|	ШаблоныОсмотров.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.ШаблоныHTML КАК ШаблоныОсмотров
		|ГДЕ
		|	ШаблоныОсмотров.Специализация = &Специализация
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныОсмотров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныHTML КАК ШаблоныОсмотров
		|ГДЕ
		|	ШаблоныОсмотров.ЭтоГруппа"
		;
		Запрос.УстановитьПараметр("Специализация", Специализация);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ГруппыШаблонов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Выб = РезультатЗапроса[0].Выбрать();
		Пока Выб.Следующий() Цикл
			Если ЗначениеЗаполнено(Выб.Ссылка)
				И Выб.ЭтоГруппа
			Тогда
				Инд = ГруппыШаблонов.Найти(Выб.Ссылка);
				Если Инд <> Неопределено Тогда
					ГруппыШаблонов.Удалить(Инд);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЭлементОформления = ТаблицаШаблонов.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		УслОформПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УслОформПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		УслОформПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		УслОформПоГруппе.ПравоеЗначение = ГруппыШаблонов;
	Иначе
		Элементы.ГруппаДобавленияПараметров.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Элементы.ТаблицаПараметровШаблона.ТекущиеДанные <> Неопределено Тогда
		ПараметрШаблона = Элементы.ТаблицаПараметровШаблона.ТекущиеДанные.Параметр;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Параметр шаблона не выбран'"));
		Возврат;
	КонецЕсли;
	
	Шаблон = Элементы.ТаблицаШаблонов.ТекущиеДанные.Ссылка;
	ДобавитьНаСервере(ДействиеМедосмотра, Шаблон, ПараметрШаблона, Наименование);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблон(Команда)
	Шаблон = ПредопределенноеЗначение("Справочник.ШаблоныHTML.ПустаяСсылка");
	ЗаполнениеПараметров(Шаблон);
	Элементы.ТаблицаШаблонов.ВыделенныеСтроки.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаШаблоновПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаШаблонов.ТекущийЭлемент <> Неопределено Тогда
		Шаблон = Элемент.ТекущиеДанные.Ссылка;
	Иначе 
	    Шаблон = Неопределено
	КонецЕсли;
	
	ЗаполнениеПараметров(Шаблон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнениеПараметров(Шаблон)
	ЗаполнениеПараметровПоШаблону(Шаблон, ТаблицаПараметровШаблона);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнениеПараметровПоШаблону(Шаблон = Неопределено, ТаблицаПараметров)
	
	ТаблицаПараметров.Очистить();
	ПараметрыШаблона = ПараметрыШаблонаПриема(Шаблон);
	
	Для Каждого Параметр Из ПараметрыШаблона Цикл
		
		ТаблицаПараметров.Добавить().Параметр = Параметр;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыШаблонаПриема(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Шаблон);
	Запрос.УстановитьПараметр("НеИспользоватьОтбор", Не ЗначениеЗаполнено(Шаблон));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблоныОсмотровСоответствияПараметрам.Параметр КАК Параметр
		|ИЗ
		|	Справочник.ШаблоныHTML.СоответствияПараметрам КАК ШаблоныОсмотровСоответствияПараметрам
		|ГДЕ &НеИспользоватьОтбор ИЛИ ШаблоныОсмотровСоответствияПараметрам.Ссылка = &Ссылка
		|";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Параметр");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьНаСервере(ДействиеМедосмотра, Шаблон, ПараметрШаблона, Наименование)
	
	МенеджерЗаписей = РегистрыСведений.ДействияМедосмотровПараметрыАвтозаключений.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.ДействиеМедосмотра = ДействиеМедосмотра;
	МенеджерЗаписей.Наименование = Наименование;
	МенеджерЗаписей.Параметр = ПараметрШаблона;
	МенеджерЗаписей.ШаблонОсмотра = Шаблон;
	МенеджерЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
